R3#show ip bgp
BGP table version is 30, local router ID is 3.3.3.3
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter,
              x best-external, a additional-path, c RIB-compressed,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 *>  3.3.3.3/32       0.0.0.0                  0         32768 ?
 r>i 4.4.4.4/32       4.4.4.4                  0    100      0 ?
 r i                  4.4.4.4                  0    100      0 ?
 *>  10.0.0.0/24      192.168.0.1              0             0 1 ?
 *>  10.0.1.0/24      0.0.0.0                  0         32768 ?
 r>i 10.0.2.0/24      4.4.4.4                  0    100      0 ?
 r i                  4.4.4.4                  0    100      0 ?
 *>i 10.0.3.0/24      192.168.1.2              0    100      0 3 ?
 * i                  4.4.4.4                  0    100      0 3 ?
 *>  10.0.20.0/24     192.168.0.1              2             0 1 ?
 * i 10.0.30.0/24     4.4.4.4                 10    100      0 3 ?
 *>i                  192.168.1.2             10    100      0 3 ?
 *   192.168.0.0      192.168.0.1              0             0 1 ?
 *>                   0.0.0.0                  0         32768 ?
     Network          Next Hop            Metric LocPrf Weight Path
 r>i 192.168.1.0      4.4.4.4                  0    100      0 ?
 r i                  4.4.4.4                  0    100      0 ?
